    <header>
        {{-- 1 уровень --}}
        <div class="bg-color">
            <div class="container">
                    {{-- полоса с навигацией --}}
                    <div class=" justify-content-center row">
                        {{-- текст --}}
                        <ul class="nav my-2 align-items-center justify-content-start my-md-0 col-8">
                            <li class="" ><a href="{{ route('about') }}" class="nav-link text-white">О нас</a></li>
                            <li class=""><a href="#" class="nav-link text-white">Как заказать</a></li>
                            <li class=""><a href="#" class="nav-link text-white">Декларации</a></li>
                            <li class=""><a href="#" class="nav-link text-white">Отзывы</a></li>
                            <li class=""> <a href="{{ route('contact') }}" class="nav-link text-white">Контакты</a></li>
                            <li class=""><a href="#" class="nav-link text-white">Outlet</a></li>
                        </ul>
                        {{-- --}}

                        {{-- соц.сети --}}
                        <ul class="nav my-2 align-items-center justify-content-end my-md-0 col-4">
                            <li><a href="https://www.whatsapp.com" class="nav-link text-white">
                                    <svg xmlns="http://www.w3.org/2000/svg" fill="#FFFFFF" width="20px" height="20px" viewBox="0 0 32 32">
                                        <path d="M26.576 5.363c-2.69-2.69-6.406-4.354-10.511-4.354-8.209 0-14.865 6.655-14.865 14.865 0 2.732 0.737 5.291 2.022 7.491l-0.038-0.070-2.109 7.702 7.879-2.067c2.051 1.139 4.498 1.809 7.102 1.809h0.006c8.209-0.003 14.862-6.659 14.862-14.868 0-4.103-1.662-7.817-4.349-10.507l0 0zM16.062 28.228h-0.005c-0 0-0.001 0-0.001 0-2.319 0-4.489-0.64-6.342-1.753l0.056 0.031-0.451-0.267-4.675 1.227 1.247-4.559-0.294-0.467c-1.185-1.862-1.889-4.131-1.889-6.565 0-6.822 5.531-12.353 12.353-12.353s12.353 5.531 12.353 12.353c0 6.822-5.53 12.353-12.353 12.353h-0zM22.838 18.977c-0.371-0.186-2.197-1.083-2.537-1.208-0.341-0.124-0.589-0.185-0.837 0.187-0.246 0.371-0.958 1.207-1.175 1.455-0.216 0.249-0.434 0.279-0.805 0.094-1.15-0.466-2.138-1.087-2.997-1.852l0.010 0.009c-0.799-0.74-1.484-1.587-2.037-2.521l-0.028-0.052c-0.216-0.371-0.023-0.572 0.162-0.757 0.167-0.166 0.372-0.434 0.557-0.65 0.146-0.179 0.271-0.384 0.366-0.604l0.006-0.017c0.043-0.087 0.068-0.188 0.068-0.296 0-0.131-0.037-0.253-0.101-0.357l0.002 0.003c-0.094-0.186-0.836-2.014-1.145-2.758-0.302-0.724-0.609-0.625-0.836-0.637-0.216-0.010-0.464-0.012-0.712-0.012-0.395 0.010-0.746 0.188-0.988 0.463l-0.001 0.002c-0.802 0.761-1.3 1.834-1.3 3.023 0 0.026 0 0.053 0.001 0.079l-0-0.004c0.131 1.467 0.681 2.784 1.527 3.857l-0.012-0.015c1.604 2.379 3.742 4.282 6.251 5.564l0.094 0.043c0.548 0.248 1.25 0.513 1.968 0.74l0.149 0.041c0.442 0.14 0.951 0.221 1.479 0.221 0.303 0 0.601-0.027 0.889-0.078l-0.031 0.004c1.069-0.223 1.956-0.868 2.497-1.749l0.009-0.017c0.165-0.366 0.261-0.793 0.261-1.242 0-0.185-0.016-0.366-0.047-0.542l0.003 0.019c-0.092-0.155-0.34-0.247-0.712-0.434z"/>
                                    </svg></a></li>
                            <li><a href="https://telegram.org" class="nav-link text-white">
                                    <svg xmlns="http://www.w3.org/2000/svg" fill="#FFFFFF" width="20px" height="20px" viewBox="0 0 32 32" >
                                        <path d="M22.122 10.040c0.006-0 0.014-0 0.022-0 0.209 0 0.403 0.065 0.562 0.177l-0.003-0.002c0.116 0.101 0.194 0.243 0.213 0.403l0 0.003c0.020 0.122 0.031 0.262 0.031 0.405 0 0.065-0.002 0.129-0.007 0.193l0-0.009c-0.225 2.369-1.201 8.114-1.697 10.766-0.21 1.123-0.623 1.499-1.023 1.535-0.869 0.081-1.529-0.574-2.371-1.126-1.318-0.865-2.063-1.403-3.342-2.246-1.479-0.973-0.52-1.51 0.322-2.384 0.221-0.23 4.052-3.715 4.127-4.031 0.004-0.019 0.006-0.040 0.006-0.062 0-0.078-0.029-0.149-0.076-0.203l0 0c-0.052-0.034-0.117-0.053-0.185-0.053-0.045 0-0.088 0.009-0.128 0.024l0.002-0.001q-0.198 0.045-6.316 4.174c-0.445 0.351-1.007 0.573-1.619 0.599l-0.006 0c-0.867-0.105-1.654-0.298-2.401-0.573l0.074 0.024c-0.938-0.306-1.683-0.467-1.619-0.985q0.051-0.404 1.114-0.827 6.548-2.853 8.733-3.761c1.607-0.853 3.47-1.555 5.429-2.010l0.157-0.031zM15.93 1.025c-8.302 0.020-15.025 6.755-15.025 15.060 0 8.317 6.742 15.060 15.060 15.060s15.060-6.742 15.060-15.060c0-8.305-6.723-15.040-15.023-15.060h-0.002q-0.035-0-0.070 0z"/>
                                    </svg></a></li>
                            <li><a href="https://vk.com" class="nav-link text-white">
                                    <svg fill="none" height="20px" viewBox="0 0 49 48" width="20px" xmlns="http://www.w3.org/2000/svg">
                                        <path clip-rule="evenodd" d="M3.87 3.37C.5 6.75.5 12.17.5 23.04v1.92c0 10.86 0 16.3 3.37 19.67C7.25 48 12.67 48 23.54 48h1.92c10.86 0 16.3 0 19.67-3.37 3.37-3.38 3.37-8.8 3.37-19.67v-1.92c0-10.86 0-16.3-3.37-19.67C41.75 0 36.33 0 25.46 0h-1.92C12.68 0 7.24 0 3.87 3.37zm4.74 11.3c.25 12.48 6.82 20 17.65 20h.63v-7.15c3.95.4 6.89 3.35 8.09 7.15h5.69a15.8 15.8 0 0 0-8.03-10.03c2.48-1.49 6-5.09 6.83-9.97h-5.18c-1.08 3.97-4.31 7.57-7.4 7.91v-7.91h-5.26v13.85c-3.2-.8-7.37-4.68-7.54-13.85z" fill="currentColor" fill-rule="evenodd"></path>
                                    </svg></a></li>
                        </ul>
                        {{-- --}}
                    </div>
            </div>
        </div>
        {{-- 2 уровень --}}
        <div class="px-0 py-2 px-sm-3 border-bottom mb-3">
            <div class="container d-flex flex-wrap justify-content-center">

                {{--логотип с ссылкой на главную страницу--}}
                <div class="d-flex align-items-center my-2 my-lg-0 me-lg-auto col-2 col-sm-1">
                    <a href="{{ route('home') }}" class="text-dark text-decoration-none">LOGO</a>
                </div>
                {{-- --}}

                {{-- каталог --}}
                <div class="dropdown d-flex flex-wrap col-2 col-1-sm justify-content-start mr-2">
                    {{-- кнопка каталога --}}
                    <button class="btn btn-secondary btn-sm " type="button" data-bs-toggle="dropdown" aria-expanded="false">
                        <svg xmlns="http://www.w3.org/2000/svg" width="20px" height="20px" viewBox="0 0 24 24" fill="none">
                            <path fill-rule="evenodd" clip-rule="evenodd" d="M5 7C5 6.44772 5.44772 6 6 6H18C18.5523 6 19 6.44772 19 7C19 7.55228 18.5523 8 18 8H6C5.44772 8 5 7.55228 5 7ZM5 12C5 11.4477 5.44772 11 6 11H18C18.5523 11 19 11.4477 19 12C19 12.5523 18.5523 13 18 13H6C5.44772 13 5 12.5523 5 12ZM5 17C5 16.4477 5.44772 16 6 16H18C18.5523 16 19 16.4477 19 17C19 17.5523 18.5523 18 18 18H6C5.44772 18 5 17.5523 5 17Z" fill="#FFFFFF"/>
                        </svg>
                    </button>
                    {{-- список каталога --}}
                    <ul class="dropdown-menu" style="">
                        <li><a class="dropdown-item" href="#">Обувь</a></li>
                        <li><a class="dropdown-item" href="#">Костюмы</a></li>
                        <li><a class="dropdown-item" href="#">Жакеты и пиджаки</a></li>
                        <li><a class="dropdown-item" href="#">Трикотаж</a></li>
                        <li><a class="dropdown-item" href="#">Купальники</a></li>
                        <li><a class="dropdown-item" href="#">Домашняя одежда</a></li>
                        <li><a class="dropdown-item" href="#">MARINA RINALDI</a></li>
                        <li><hr class="dropdown-divider"></li>
                        <li><a class="dropdown-item" href="#">Separated link</a></li>
                    </ul>
                </div>
                {{-- --}}

                {{-- поисковая строка --}}
                <form class=" col-4 col-6-sm ml-2 mb-2 mb-lg-0 me-lg-auto" role="search">
                    <input type="search" class="form-control" placeholder="Поиск" aria-label="Search">
                </form>
                {{-- --}}

                {{-- кнопки корзины, избранного и входа --}}
                <div class="col-4 col-4-sm text-end mr-auto">
                    {{-- корзина --}}
                    <button type="button" class="btn btn-light text-dark">
                        <svg xmlns="http://www.w3.org/2000/svg" width="20px" height="20px" viewBox="0 0 24 24" fill="none">
                            <path fill-rule="evenodd" clip-rule="evenodd" d="M12 4C10.4508 4 9.0799 5.00309 8.61115 6.47966L7.81104 9H8.49995H15.5H16.1889L15.3888 6.47966C14.92 5.00309 13.5491 4 12 4ZM18.2872 9L17.295 5.8745C16.5626 3.56734 14.4206 2 12 2C9.57933 2 7.43733 3.56734 6.7049 5.8745L5.71268 9H3.34789C2.00585 9 1.04464 10.2956 1.43384 11.58L2.55808 15.29L3.94596 19.87C4.32928 21.135 5.49529 22 6.81704 22H9.99995H14H17.1829C18.5046 22 19.6706 21.135 20.0539 19.87L21.4418 15.29L22.5661 11.58C22.9553 10.2956 21.9941 9 20.652 9H18.2872ZM6.4444 11H3.34789L4.25698 14H8.03615L7.62706 11H6.4444ZM9.64557 11L10.0547 14H13.9452L14.3543 11H9.64557ZM16.3728 11L15.9638 14H19.7429L20.652 11H17.5555H16.3728ZM19.1369 16H15.691L15.1456 20H17.1829C17.6235 20 18.0121 19.7117 18.1399 19.29L19.1369 16ZM13.1271 20L13.6725 16H10.3274L10.8728 20H13.1271ZM8.85434 20L8.30888 16H4.86304L5.86001 19.29C5.98778 19.7117 6.37646 20 6.81704 20H8.85434Z" fill="#000000"/>
                        </svg>
                    </button>
                    {{-- избранное --}}
                    <button type="button" class="btn btn-light text-dark">
                        <svg xmlns="http://www.w3.org/2000/svg" width="20px" height="20px" viewBox="0 0 24 24" fill="none">
                            <path fill-rule="evenodd" clip-rule="evenodd" d="M12.509 20.86C18.78 17.154 22 13.22 22 9c0-6.002-6.749-7.89-10-3.898C8.749 1.111 2 2.998 2 9c0 4.22 3.219 8.153 9.491 11.86a1 1 0 0 0 1.018 0zm.402-13.448C14.677 3.51 20 4.542 20 9c0 3.253-2.616 6.55-8 9.834C6.617 15.549 4 12.254 4 9c0-4.459 5.323-5.49 7.089-1.588.355.784 1.467.784 1.822 0z" fill="#000000"/>
                        </svg>
                    </button>
                    {{-- личный кабинет --}}
                    <button type="button" class="btn btn-primary">
                        <svg xmlns="http://www.w3.org/2000/svg" width="20px" height="20px" viewBox="0 0 24 24" fill="none">
                            <path fill-rule="evenodd" clip-rule="evenodd" d="M12 14.35c-3.25 0-5-3.175-5-6.725C7 4.15 9 2 12 2s5 2.15 5 5.625c0 3.55-1.75 6.725-5 6.725zm0-2c1.74 0 3-1.849 3-4.725C15 5.246 13.878 4 12 4S9 5.246 9 7.625c0 2.876 1.26 4.725 3 4.725zm-7.06 9.648a1 1 0 0 0 1.058-.938C6.114 19.138 8.041 18 12.004 18c3.96 0 5.883 1.136 6 3.06A1 1 0 0 0 20 20.94c-.195-3.218-3.11-4.94-7.996-4.94-4.89 0-7.81 1.724-8.002 4.94a1 1 0 0 0 .938 1.058z" fill="#FFFFFF"/>
                        </svg>
                    </button>
                    {{-- --}}
                </div>
            </div>
        </div>
    </header>
